tutorials/cfdemSolverIBTorque/CFD/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);	//velocity in micrometres per second

boundaryField
{
    inlet   
    {
        type            fixedValue;
	value		$internalField;
    } 
	
    channelWall      
    {
        type            zeroGradient;
    }

    outlet      
    {
        type            fixedValue;
	value		$internalField;
    }
}

// ************************************************************************* //
